<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	
	<!-- *************************** OPTIONAL KEYS *************************** -->
	<!-- All keys below this comment are only optional but help the user with more information about the payload. -->
	
	<!-- This key should contain a URL to the download page of the application it's configuring. -->
	<key>pfm_app_url</key>
	<string>https://github.com/App-Auto-Patch/App-Auto-Patch/releases</string>
	
	<!-- This key should contain a URL to the documentation of the keys this application supports. (And from where you have taken the information to create this manifest)-->
	<key>pfm_documentation_url</key>
	<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
	
	<!-- The scope where this payload is valid. -->
	<!-- If this payload is only for iOS and tvOS this should be set to only system.-->
	<!-- On macOS you include all scopes this payload is valid to install to. -->
	<!-- If this is not included, it will default to system AND user.-->
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	
	<!-- The platforms where this payload is valid. -->
	<!-- If this is not included, it will default to only macOS. -->
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	
	<!-- *************************** REQUIRED KEYS *************************** -->
	<!-- All keys below this comment are required for this manifest to be loaded by the framework. -->

	<!-- A description of the payload. -->
	<key>pfm_description</key>
	<string>This will configure the settings for the App Auto-Patch tool</string>
	
	<!-- The preference domain of the payload. This should be the same as PayloadType in the pfm_subkeys.-->
	<key>pfm_domain</key>
	<string>xyz.techitout.appAutoPatch</string>
	
	<!-- The format version is used by the application to know it can support all manifest keys in this manifest. -->
	<!-- Sometimes new keys are added, but those will not be supported by older versions of the application. -->
	<!-- To avoid creating invalid payloads because of that, the app will not load manifests with newer format versions that it can support. -->
	<!-- See this page for the current versions: https://github.com/erikberglund/ProfileManifests/wiki/Manifest-Format-Versions -->
	<key>pfm_format_version</key>
	<integer>1</integer>
	
	<!-- Date the manifest was last modified. This is used for manifest collision. -->
	<!-- Read more about that here: https://github.com/erikberglund/ProfileManifests/wiki/Manifest-Collision -->
	<key>pfm_last_modified</key>
	<date>2025-03-02T17:15:00Z</date>
	
	<!-- This is the title of the manifest -->
	<key>pfm_title</key>
	<string>App Auto-Patch</string>
	
	<!-- This determines if there can be more than one payload in the profile for this PayloadType. -->
	<key>pfm_unique</key>
	<true/>
	
	<!-- This is the version number of this manifest, it's used to determine which manifest to load if two manifests with identical "pfm_domain" is found-->
	<key>pfm_version</key>
	<integer>1</integer>
	
	<!-- This is an array of all keys this payload can configure. They will be shown in order. -->
	<key>pfm_subkeys</key>
	<array>
		
		<!-- *************************** REQUIRED KEYS *************************** -->
		<!-- Currently the "base" keys for each payload must be defined in each manifest -->
		<!-- That is something I hope to move into the application and make the settings more simple. -->
		<!-- But for now, these are required to create a valid payload on export. -->
		
		<!-- PayloadDescription -->
		<!-- Description for the payload shown when the payload is installed. -->
		<dict>
			<key>pfm_default</key>
			<string>Configures App Auto-Patch configuration preferences</string> <!-- CHANGE THIS VALUE -->
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadDisplayName -->
		<!-- Display Name of the payload shown when the payload is installed. -->
		<dict>
			<key>pfm_default</key>
			<string>App Auto-Patch</string> <!-- CHANGE THIS VALUE -->
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadIdentifier -->
		<!-- The base identifier this payload should use. This will then be expanded by the application to add the root identifier + the payload UUID to create a unique identifier automatically. -->
		<dict>
			<key>pfm_default</key>
			<string>xyz.techitout.appAutoPatch</string> <!-- CHANGE THIS VALUE TO THE SAME AS pfm_domain and PayloadType -->
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadType -->
		<!-- This is the PayloadType of the payload. -->
		<dict>
			<key>pfm_default</key>
			<string>xyz.techitout.appAutoPatch</string> <!-- CHANGE THIS VALUE TO THE SAME AS pfm_domain and PayloadIdentifier -->
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadUUID -->
		<!-- This is the PayloadUUID and it will be generated automatically. You should NOT edit this. -->
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadVersion -->
		<!-- This is the version of the payload. You should NOT edit this. -->
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		
		<!-- PayloadOrganization -->
		<!-- This is the organization of the payload. You should NOT edit this. -->
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- *************************** APPLICATION KEYS *************************** -->
		<!-- You should add all keys this payload can manage below this comment. -->
		
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Deferrals and Deadlines</string>
				<string>Dialogs and Notifications</string>
				<string>Labels</string>
				<string>Workflow and Options</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Deferrals and Deadlines</key>
				<array>
					<string>DaysUntilReset</string>
					<string>PatchWeekStartDay</string>
					<string>DeadlineCountFocus</string>
					<string>DeadlineCountHard</string>
					<string>DeadlineDaysFocus</string>
					<string>DeadlineDaysHard</string>
					<string>DeferralTimerDefault</string>
					<string>DeferralTimerError</string>
					<string>DeferralTimerFocus</string>
					<string>DeferralTimerMenu</string>
					<string>DeferralTimerWorkflowRelaunch</string>
				</array>
				<key>Dialogs and Notifications</key>
				<array>
					<string>DialogOnTop</string>
					<string>DialogTimeoutDeferral</string>
					<string>DialogTimeoutDeferralAction</string>
					<string>UnattendedExit</string>
					<string>UnattendedExitSeconds</string>
					<string>UseOverlayIcon</string>
				</array>
				<key>Labels</key>
				<array>
					<string>IgnoredLabels</string>
					<string>OptionalLabels</string>
					<string>RequiredLabels</string>
				</array>
				<key>Workflow and Options</key>
				<array>
					<string>AppTitle</string>
					<string>ConvertAppsInHomeFolder</string>
					<string>IgnoreAppsInHomeFolder</string>
					<string>InstallomatorOptions</string>
					<string>InstallomatorVersion</string>
					<string>InteractiveMode</string>
					<string>RemoveInstallomatorPath</string>
					<string>SupportTeamName</string>
					<string>SupportTeamEmail</string>
					<string>SupportTeamPhone</string>
					<string>SupportTeamWebsite</string>
					<string>WebhookFeature</string>
					<string>WebhookURLSlack</string>
					<string>WebhookURLTeams</string>
					<string>WorkflowDisableAppDiscovery</string>
					<string>WorkflowDisableRelaunch</string>
					<string>WorkflowInstallNowPatchingStatusAction</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		
		
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>DaysUntilReset</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Days Until Reset</string>
			<key>pfm_description</key>
			<string>The number of days after the patching cadence start date (Zero Date) that the patching complete status will reset from TRUE to FALSE</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#daysuntilreset</string>
			<key>pfm_value_placeholder</key>
			<integer>7</integer>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>PatchWeekStartDay</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Patch Week Start Day</string>
			<key>pfm_description</key>
			<string>The day of the week to force the patching cadence start date (Zero Date) to go back to in order to have the patch cadence start the same day of the week for all users</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#patchweekstartday</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
				<integer>4</integer>
				<integer>5</integer>
				<integer>6</integer>
				<integer>7</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Monday - 1</string>
				<string>Tuesday - 2</string>
				<string>Wednesday - 3</string>
				<string>Thursday - 4</string>
				<string>Friday - 5</string>
				<string>Saturday - 6</string>
				<string>Sunday - 7</string>
			</array>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>The maximum number of automatic deferrals allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#deadlinecountfocus</string>
			<key>pfm_name</key>
			<string>DeadlineCountFocus</string>
			<key>pfm_title</key>
			<string>Focus Count Deadline</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>5</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>The maximum number of user selected deferrals allowed before App Auto-Patch will no longer allow deferrals and will automatically patch when the timer expires</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#deadlinecounthard</string>
			<key>pfm_name</key>
			<string>DeadlineCountHard</string>
			<key>pfm_title</key>
			<string>Hard Count Deadline</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>5</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.1</string>
			<key>pfm_description</key>
			<string>The maximum number of days that automatic deferrals are allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Days-Deadlines</string>
			<key>pfm_name</key>
			<string>DeadlineDaysFocus</string>
			<key>pfm_title</key>
			<string>Focus Days Deadline</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>5</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.1</string>
			<key>pfm_description</key>
			<string>The maximum number of days deferrals allowed before App Auto-Patch will no longer allow deferrals and will automatically patch when the timer expires</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Days-Deadlines</string>
			<key>pfm_name</key>
			<string>DeadlineDaysHard</string>
			<key>pfm_title</key>
			<string>Hard Days Deadline</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>5</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>The number of minutes to defer until the next update workflow attempt if a user choses not install updates</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#deferraltimerdefault</string>
			<key>pfm_name</key>
			<string>DeferralTimerDefault</string>
			<key>pfm_title</key>
			<string>Deferral Timer Default</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>1440</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>The number of minutes to defer if AAP detects an error in the workflow</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#deferraltimererror</string>
			<key>pfm_name</key>
			<string>DeferralTimerError</string>
			<key>pfm_title</key>
			<string>Deferral Timer Error</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>60</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>The number of minutes to defer the update restart dialog automatically if a process has prevented display sleep (for example, during an active meeting) or the user has Focus or Do Not Disturb enabled</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#deferraltimerfocus</string>
			<key>pfm_name</key>
			<string>DeferralTimerFocus</string>
			<key>pfm_title</key>
			<string>Deferral Timer Focus</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>60</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>Display a deferral time pop-up menu in the non-deadline install dialog that allows the user to override the Deferral Timer Default timer</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#deferraltimermenu</string>
			<key>pfm_name</key>
			<string>DeferralTimerMenu</string>
			<key>pfm_title</key>
			<string>Deferral Timer Menu</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>120,1440,10080</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>Amount of time in minutes until AAP is relaunched after a workflow. This timer results in AAP acting as a permanent agent that checks for app updates on a regular basis</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#deferraltimerworkflowrelaunch</string>
			<key>pfm_name</key>
			<string>DeferralTimerWorkflowRelaunch</string>
			<key>pfm_title</key>
			<string>Deferral Timer Workflow Relaunch</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>1440</string>
		</dict>





		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>DialogOnTop</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Dialog On Top</string>
			<key>pfm_description</key>
			<string>Forces the AAP dialogs to stay on top of all other windows</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#dialogontop</string>
			<key>pfm_range_list</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>Time given to the user to respond to deferral prompt if enabled</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>DialogTimeoutDeferral</string>
			<key>pfm_title</key>
			<string>Deferral Dialog Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>300</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>DialogTimeoutDeferralAction</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Deferral Dialog Timeout Action</string>
			<key>pfm_description</key>
			<string>What happens when the deferral timer expires</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_range_list</key>
			<array>
				<string>Defer</string>
				<string>Continue</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Defer</string>
				<string>Continue</string>
			</array>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>UnattendedExit</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Unattended Exit</string>
			<key>pfm_description</key>
			<string>Deterines if the Dialog should automatically close after completion if there is no response from the end-user</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_range_list</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>The number of seconds the AAP dialog will automatically close if UnattendedExit is set to TRUE</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>UnattendedExitSeconds</string>
			<key>pfm_title</key>
			<string>Unattended Exit Seconds</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>60</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>UseOverlayIcon</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Use Overlay Icon</string>
			<key>pfm_description</key>
			<string>Toggles swiftDialog to use an overlay icon</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_range_list</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
		</dict>

		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>A space-separated list of Installomator labels to ignore for the AAP workflow. Supports wilddcards</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>IgnoredLabels</string>
			<key>pfm_title</key>
			<string>Ignored Labels</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>1password* androidstudio microsoft*</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>a space-separated list of Installomator labels that are required, regardless if the app is installed or or the latest version. Supports wildcards.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>RequiredLabels</string>
			<key>pfm_title</key>
			<string>Required Labels</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>1password* androidstudio microsoft*</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>A space-separated list of optional Installomator labels. Labels in this category are only included if the app exists on the end-users device and will force install even if its the latest version. Does Not Support Wildcards</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>OptionalLabels</string>
			<key>pfm_title</key>
			<string>Optional Labels</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>1password androidstudio googlechromepkg</string>
		</dict>

		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>Allows you to customize the name of App Auto-Patch to something else</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>AppTitle</string>
			<key>pfm_title</key>
			<string>App Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_default</key>
			<string>App Auto-Patch</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>ConvertAppsInHomeFolder</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Convert Apps In Home Folder</string>
			<key>pfm_description</key>
			<string>This will convert any apps found in the users home folder to the /Applications folder</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#convertappsinhomefolder</string>
			<key>pfm_range_list</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_default</key>
			<string>TRUE</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>IgnoreAppsInHomeFolder</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Ignore Apps In Home Folder</string>
			<key>pfm_description</key>
			<string>Ignore apps found in '/Users/'. If an update is found in '/Users/' and variable is set to false, the app will be updated into the application's default path</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings#ignoreappsinhomefolder</string>
			<key>pfm_range_list</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_default</key>
			<string>FALSE</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>A space-separated list of options to override default Installomator options (i.e., BLOCKING_PROCESS_ACTION=prompt_user NOTIFY=silent LOGO=appstore)</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>InstallomatorOptions</string>
			<key>pfm_title</key>
			<string>Installomator Options</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>BLOCKING_PROCESS_ACTION=quit_kill NOTIFY=silent</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>InstallomatorVersion</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Installomator Version</string>
			<key>pfm_description</key>
			<string>Determines if the AAP script should use the Main (beta) or Release version of Installomator. The version from the Main branch typically includes more recent updates from PR's to fix issues or add new labels.</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_range_list</key>
			<array>
				<string>Main</string>
				<string>Release</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Main</string>
				<string>Release</string>
			</array>
			<key>pfm_default</key>
			<string>Main</string>
		</dict>






		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>InteractiveMode</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_title</key>
			<string>Interactive Mode</string>
			<key>pfm_description</key>
			<string>0 (Completely Silent) | 1 (Silent Discovery, Interactive Patching) | 2 (Full Interactive) (default)</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>0 - Completely Silent</string>
				<string>1 - Silent Discovery, Interactive Patching</string>
				<string>2 - Full Interactive</string>
			</array>
			<key>pfm_default</key>
			<string>2</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>RemoveInstallomatorPath</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Remove Installomator Path</string>
			<key>pfm_description</key>
			<string>Remove Installomator after App Auto-Patch is completed</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_range_list</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_default</key>
			<string>FALSE</string>
		</dict>

		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>For the Support Team details that display in the Help Message</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>SupportTeamName</string>
			<key>pfm_title</key>
			<string>Support Team Name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Support Team Name</string>
		</dict>
		
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>For the Support Team details that display in the Help Message</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>SupportTeamEmail</string>
			<key>pfm_title</key>
			<string>Support Team Email</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Support Team Email</string>
		</dict>

		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>For the Support Team details that display in the Help Message</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>SupportTeamPhone</string>
			<key>pfm_title</key>
			<string>Support Team Phone</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Support Team Phone</string>
		</dict>

		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>For the Support Team details that display in the Help Message</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>SupportTeamWebsite</string>
			<key>pfm_title</key>
			<string>Support Team Website</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Support Team Website</string>
		</dict>
		
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_name</key>
			<string>WebhookFeature</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Webhook Feature</string>
			<key>pfm_description</key>
			<string>Determines if Webhooks are sent when patching is completed</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_range_list</key>
			<array>
				<string>FALSE</string>
				<string>ALL</string>
				<string>FAILURES</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>FALSE</string>
				<string>ALL</string>
				<string>FAILURES</string>
			</array>
			<key>pfm_default</key>
			<string>FAILURES</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>The Slack Webhook URL to use if WebhookFeature is set to TRUE</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>WebhookURLSlack</string>
			<key>pfm_title</key>
			<string>Slack Webhook URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://webhook.slack.com</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>The Teams Webhook URL to use if WebhookFeature is set to TRUE</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>WebhookURLTeams</string>
			<key>pfm_title</key>
			<string>Teams Webhook URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://webhook.microsoft.com</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>Disables the discovery of applications that require patching. If a list of labels from a previous discovery exists, AAP will use that list for the workflow</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>WorkflowDisableAppDiscovery</string>
			<key>pfm_title</key>
			<string>Disable App Discovery Workflow</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_range_list</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_default</key>
			<string>FALSE</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0</string>
			<key>pfm_description</key>
			<string>Disable the automatic relaunch of AAP after the current workflow successfully completes</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_name</key>
			<string>WorkflowDisableRelaunch</string>
			<key>pfm_title</key>
			<string>Disable Relaunch Workflow</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_range_list</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>TRUE</string>
				<string>FALSE</string>
			</array>
			<key>pfm_default</key>
			<string>FALSE</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.1</string>
			<key>pfm_name</key>
			<string>WorkflowInstallNowPatchingStatusAction</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Workflow Install Now Patching Status Action</string>
			<key>pfm_description</key>
			<string>Determines if the Patching Completion Status is set to true when using the --workflow-install-now trigger</string>
			<key>pfm_description_reference</key>
			<string>https://github.com/App-Auto-Patch/App-Auto-Patch/wiki/Configure-Settings</string>
			<key>pfm_range_list</key>
			<array>
				<string>NEVER</string>
				<string>ALWAYS</string>
				<string>SUCCESS</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>NEVER</string>
				<string>ALWAYS</string>
				<string>SUCCESS</string>
			</array>
			<key>pfm_default</key>
			<string>SUCCESS</string>
		</dict>
		
		
		
		
		
		
		

	</array>
</dict>
</plist>
